{"object": [
{
    "course_identifier": "NSCI 1000",
    "course_code": "NSCI1000",
    "course_number": 1000,
    "course_title": "NSCI1000 [0.5 credit]",
    "course_desc": "Cross-disciplinary survey of current issues in science, providing new science students with an orientation to the study of science at the university level. Structured around seminars, oral and written presentations.",
    "course_extra_details": "Prerequisite(s): Restricted to students in the first year of B.Sc. programs or B.A. Biology programs.\nLectures and tutorials three hours a week.\n",
    "course_prerequisites": "Restricted to students in the first year of B.Sc. programs or B.A. Biology programs.",
    "year_standing": 0
},

{
    "course_identifier": "NSCI 2000",
    "course_code": "NSCI2000",
    "course_number": 2000,
    "course_title": "NSCI2000 [0.5 credit]",
    "course_desc": "Cross-disciplinary survey of current issues in science, with a focus on applying interdisciplinary approaches to solving scientific problems. Structured around seminars, oral and written presentations. Focus on EDI, community outreach, and experiential learning.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrerequisite(s): Second year standing in B.Sc. programs or B.A. Biology programs or permission of the Institute.\nLecture, Seminar, or workshops three hours a week\n",
    "course_prerequisites": "Second year standing in B.Sc. programs or B.A. Biology programs or permission of the Institute.",
    "year_standing": 0
},

{
    "course_identifier": "NSCI 4901",
    "course_code": "NSCI4901",
    "course_number": 4901,
    "course_title": "NSCI4901 [1.0 credit]",
    "course_desc": "Students will work with a health or life science research group and deliver an in-depth narrative on the relevant scientific research, lab dynamics and results.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrerequisite(s): fourth-year standing in the Bachelor of Journalism and at least 3.5 credits completed in the concentration in Health Science, or permission of the School of Journalism and Communication.\n",
    "course_prerequisites": "fourth-year standing in the Bachelor of Journalism and at least 3.5 credits completed in the concentration in Health Science, or permission of the School of Journalism and Communication.",
    "year_standing": 4
}]}