{"object": [
{
    "course_identifier": "STAT 1500",
    "course_code": "STAT1500",
    "course_number": 1500,
    "course_title": "STAT1500 [0.5 credit]",
    "course_desc": "Basics of programming in R and introduction to statistical software; generating statistical plots; computing descriptive statistics; performing basic statistical procedures; fundamentals of numerical analysis; optimization; generating random numbers, performing simple simulations and simulation-based inference.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrerequisite(s): Ontario Grade 12 Mathematics: Advanced Functions, or MATH0005, or equivalent.\nLectures three hours a week, laboratory one hour a week.\n",
    "course_prerequisites": "Ontario Grade 12 Mathematics: Advanced Functions, or MATH0005, or equivalent.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 2507",
    "course_code": "STAT2507",
    "course_number": 2507,
    "course_title": "STAT2507 [0.5 credit]",
    "course_desc": "A data-driven introduction to statistics. Basic descriptive statistics, introduction to probability theory, random variables, discrete and continuous distributions, contingency tables, sampling distributions, distribution of sample mean, Central Limit Theorem, interval estimation and hypothesis testing.  A statistical software package will be used.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrecludes additional credit for BIT2000, BIT2009, BIT 2100 (no longer offered), BIT 2300 (no longer offered), ECON 2201 (no longer offered), ECON2210, ENST2006, GEOG2006, STAT2601, STAT 2606, and STAT3502. May not be counted for credit in any program if taken after successful completion of STAT2559.\nPrerequisite(s): an Ontario Grade 12 university-preparation Mathematics or equivalent, or permission of the School of Mathematics and Statistics.\nLectures three hours a week, laboratory one hour a week.\n",
    "course_prerequisites": "an Ontario Grade 12 university-preparation Mathematics or equivalent, or permission of the School of Mathematics and Statistics.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 2509",
    "course_code": "STAT2509",
    "course_number": 2509,
    "course_title": "STAT2509 [0.5 credit]",
    "course_desc": "A data-driven approach to statistical modeling. Basics of experimental design, analysis of variance, simple linear regression and correlation, nonparametric procedures. A statistical software package will be used.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrecludes additional credit for STAT2602, STAT 2607, ECON 2202, ECON2220.\nPrerequisite(s): STAT2507 or STAT2601 or STAT 2606 or STAT3502; or permission of the School.\nLectures three hours a week, laboratory one hour a week.\n",
    "course_prerequisites": "STAT2507 or STAT2601 or STAT 2606 or STAT3502; or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 2559",
    "course_code": "STAT2559",
    "course_number": 2559,
    "course_title": "STAT2559 [0.5 credit]",
    "course_desc": "Estimation and hypothesis testing for one and two samples, analysis of categorical data, basics of experimental design, analysis of variance, simple linear regression and correlation. Nonparametric procedures. A statistical software package will be used.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrerequisite(s): STAT2655 or permission of the School.\nLectures three hours a week, tutorial/laboratory one hour a week.\n",
    "course_prerequisites": "STAT2655 or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 2601",
    "course_code": "STAT2601",
    "course_number": 2601,
    "course_title": "STAT2601 [0.5 credit]",
    "course_desc": "Introduction to statistical computing, descriptive statistics, probability concepts, interval estimation and hypothesis testing, categorical data analysis. Introduction to simple regression, multiple regression, and time series. Emphasis on the development of an ability to interpret results of statistical analyses with applications from business.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrecludes additional credit for BIT2000, BIT2009, BIT 2100 (no longer offered), BIT 2300 (no longer offered), ECON 2201 (no longer offered), ECON2210, ENST2006, GEOG2006, STAT2507, STAT 2606 (no longer offered) and STAT3502.\nPrerequisite(s): MATH1009. Restricted to B.Com. and B.I.B students.\nLectures three hours a week and laboratory one hour a week.\n",
    "course_prerequisites": "MATH1009. Restricted to B.Com. and B.I.B students.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 2602",
    "course_code": "STAT2602",
    "course_number": 2602,
    "course_title": "STAT2602 [0.5 credit]",
    "course_desc": "Analysis of variance, multiple regression (including polynomial regression), logistic and Poisson regression, probit models, time series (including decomposition into components, exponential smoothing, model diagnostics and ARIMA models), Monte Carlo simulation.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrecludes additional credit for ECON2220, STAT 2607 (no longer offered).\nPrerequisite(s): STAT2601.\nLectures three hours a week and laboratory one hour a week.\n",
    "course_prerequisites": "STAT2601.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 2605",
    "course_code": "STAT2605",
    "course_number": 2605,
    "course_title": "STAT2605 [0.5 credit]",
    "course_desc": "Basic probability; discrete random variables with focus on binomial and Poisson random variables; continuous random variables, transformation theorem, simulating continuous random variables; exponential random variable, normal random variable, sums of random variables, central limit theorem.  Elements of Markov chains, and introduction to Poisson processes.",
    "course_extra_details": "Precludes additional credit for STAT2655 and STAT3502.\nPrerequisite(s): MATH1007 or MATH1004 or MATH 1002 (no longer offered) or MATH1052, and MATH1104 or MATH1107 or MATH 1102 (no longer offered) or MATH1152. Restricted to students in Bachelor of Computer Science and Bachelor of Mathematics in Computer Mathematics.\nLectures three hours a week, tutorial one hour a week.\n",
    "course_prerequisites": "MATH1007 or MATH1004 or MATH 1002 (no longer offered) or MATH1052, and MATH1104 or MATH1107 or MATH 1102 (no longer offered) or MATH1152. Restricted to students in Bachelor of Computer Science and Bachelor of Mathematics in Computer Mathematics.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 2655",
    "course_code": "STAT2655",
    "course_number": 2655,
    "course_title": "STAT2655 [0.5 credit]",
    "course_desc": "Probability axioms, basic combinatorial analysis, conditional probability and independence, discrete and continuous random variables, joint and conditional distributions, expectation and moments, probability and moment generating functions, Chebyshev's inequality and weak law of large numbers, central limit theorem, sampling distributions, simulation and applications to descriptive statistics.",
    "course_extra_details": "Precludes additional credit for STAT2605.\nPrerequisite(s): MATH2052 with a grade of C+ or higher or MATH2007 or MATH1005 with a grade of B+ or higher; and MATH2152 with a grade of C+ or higher or MATH2107 with a grade of B+ or higher; or permission of the School.\nLectures three hours a week, tutorial one hour a week.\n",
    "course_prerequisites": "MATH2052 with a grade of C+ or higher or MATH2007 or MATH1005 with a grade of B+ or higher; and MATH2152 with a grade of C+ or higher or MATH2107 with a grade of B+ or higher; or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 2660",
    "course_code": "STAT2660",
    "course_number": 2660,
    "course_title": "STAT2660 [0.5 credit]",
    "course_desc": "Interest rates, growth of money, discount functions, yield rates, time value of money, annuities, cash flows and portfolios, loans, mortgages, bonds, immunization, swaps, hedging and investment strategies, stocks and financial markets, arbitrage.",
    "course_extra_details": "Prerequisite(s): i) one of MATH2052 or MATH2007 or MATH1005, grade of C+ or higher; and ii) one of MATH1152 or MATH1107 or MATH1104, grade of C+ or higher; or permission of the School.\nLectures three hours a week, tutorial one hour a week.\n",
    "course_prerequisites": "i) one of MATH2052 or MATH2007 or MATH1005, grade of C+ or higher; and ii) one of MATH1152 or MATH1107 or MATH1104, grade of C+ or higher; or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 2907",
    "course_code": "STAT2907",
    "course_number": 2907,
    "course_title": "STAT2907 [0.5 credit]",
    "course_desc": "Available only to Honours students whose program requires a 0.5 credit not offered by the School of Mathematics and Statistics.",
    "course_extra_details": null,
    "course_prerequisites": null,
    "year_standing": 0
},

{
    "course_identifier": "STAT 3502",
    "course_code": "STAT3502",
    "course_number": 3502,
    "course_title": "STAT3502 [0.5 credit]",
    "course_desc": "Axioms of probability; conditional probability and independence; random variables; distributions: binomial, Poisson, hypergeometric, normal, gamma; central limit theorem; sampling distributions; point estimation: maximum likelihood, method of moments; confidence intervals; testing of hypotheses: one and two populations; engineering applications: acceptance sampling, control charts, reliability.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrecludes additional credit for BIT2000, BIT2009, BIT 2100 (no longer offered), BIT 2300 (no longer offered), ECON 2201 (no longer offered), ECON2210, STAT2507, STAT2605, STAT2601, and STAT 2606.\nPrerequisite(s): MATH2004 and enrolment in the Faculty of Engineering or B.Sc. programs of the Department of Physics [except Double Honours Mathematics and Physics].\nLectures three hours a week and one hour laboratory.\n",
    "course_prerequisites": "MATH2004 and enrolment in the Faculty of Engineering or B.Sc. programs of the Department of Physics [except Double Honours Mathematics and Physics].",
    "year_standing": 0
},

{
    "course_identifier": "STAT 3503",
    "course_code": "STAT3503",
    "course_number": 3503,
    "course_title": "STAT3503 [0.5 credit]",
    "course_desc": "Review of simple and multiple regression with matrices, Gauss-Markov theorem, polynomial regression, indicator variables, residual analysis, weighted least squares, variable selection techniques, nonlinear regression, correlation analysis and autocorrelation. Computer packages are used for statistical analyses.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrecludes additional credit for STAT3553.\nPrerequisite(s): i) STAT2509 or STAT2602 or STAT 2607 or ECON 2202 or ECON2220 or equivalent; and ii) MATH1152 or MATH1107 or MATH1119 or equivalent; or permission of the School.\nLectures three hours a week and one hour laboratory.\n",
    "course_prerequisites": "i) STAT2509 or STAT2602 or STAT 2607 or ECON 2202 or ECON2220 or equivalent; and ii) MATH1152 or MATH1107 or MATH1119 or equivalent; or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 3504",
    "course_code": "STAT3504",
    "course_number": 3504,
    "course_title": "STAT3504 [0.5 credit]",
    "course_desc": "Single and multifactor analysis of variance, orthogonal contrasts and multiple comparisons, analysis of covariance; nested, crossed and repeated measures designs; completely randomized, randomized block, Latin squares, factorial experiments, related topics. Computer packages are used for statistical analyses.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrecludes additional credit for STAT4504.\nPrerequisite(s): STAT3503 or permission of the School.\nLectures three hours a week and one hour laboratory.\n",
    "course_prerequisites": "STAT3503 or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 3506",
    "course_code": "STAT3506",
    "course_number": 3506,
    "course_title": "STAT3506 [0.5 credit]",
    "course_desc": "Conditional probability and conditional expectation; Stochastic modeling; discrete time Markov chains including classification of states, stationary and limiting distributions; exponential distribution and the Poisson processes; queueing models; applications to computer systems, operations research and social sciences.",
    "course_extra_details": "Prerequisite(s): STAT2655 with a grade of C- or higher; or permission of the School.\nLectures three hours a week, tutorial one hour a week.\n",
    "course_prerequisites": "STAT2655 with a grade of C- or higher; or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 3507",
    "course_code": "STAT3507",
    "course_number": 3507,
    "course_title": "STAT3507 [0.5 credit]",
    "course_desc": "The sample survey as a vehicle for information collection in government, business, scientific and social agencies. Topics include: planning a survey, questionnaire design, simple random, stratified, systematic and cluster sampling designs, estimation methods, problem of non-response, related topics.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrerequisite(s): one of: STAT2507, STAT2509, STAT2601, STAT2602, STAT 2606, STAT 2607, ECON 2201, ECON 2202, ECON2210, ECON2220, or equivalent; or permission of the School.\nLectures three hours a week and one hour laboratory.\n",
    "course_prerequisites": "one of: STAT2507, STAT2509, STAT2601, STAT2602, STAT 2606, STAT 2607, ECON 2201, ECON 2202, ECON2210, ECON2220, or equivalent; or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 3508",
    "course_code": "STAT3508",
    "course_number": 3508,
    "course_title": "STAT3508 [0.5 credit]",
    "course_desc": "Discrete and continuous distributions, moment-generating functions, marginal and conditional distributions, transformation theory, limiting distributions.",
    "course_extra_details": "Precludes additional credit for STAT3558 and STAT 3608.\nPrerequisite(s): i) MATH2008 (or MATH2004 or MATH 2009); and ii) one of STAT2507, STAT2601, STAT 2606, ECON 2200, or ECON 2201 or permission of the School.\nLectures three hours a week, tutorial one hour a week.\n",
    "course_prerequisites": "i) MATH2008 (or MATH2004 or MATH 2009); and ii) one of STAT2507, STAT2601, STAT 2606, ECON 2200, or ECON 2201 or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 3509",
    "course_code": "STAT3509",
    "course_number": 3509,
    "course_title": "STAT3509 [0.5 credit]",
    "course_desc": "Point and interval estimation, sufficient statistics, hypothesis testing, chi-square tests with enumeration data.",
    "course_extra_details": "Precludes additional credit for STAT3559.\nPrerequisite(s): STAT3508 or permission of the School.\nLectures three hours a week, tutorial one hour a week.\n",
    "course_prerequisites": "STAT3508 or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 3553",
    "course_code": "STAT3553",
    "course_number": 3553,
    "course_title": "STAT3553 [0.5 credit]",
    "course_desc": "Linear regression  - theory, methods and application(s). Normal distribution theory. Hypothesis tests and confidence intervals. Model selection. Model diagnostics. Introduction to weighted least squares and generalized linear models.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrecludes additional credit for STAT3503.\nPrerequisite(s): i) STAT2559 with a grade of C- or higher, or STAT2509 with a grade of B or higher; and ii) a grade of C- or higher in MATH1152 or MATH1107 or MATH1104; or permission of the School.\nLectures three hours a week, laboratory one hour a week.\n",
    "course_prerequisites": "i) STAT2559 with a grade of C- or higher, or STAT2509 with a grade of B or higher; and ii) a grade of C- or higher in MATH1152 or MATH1107 or MATH1104; or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 3558",
    "course_code": "STAT3558",
    "course_number": 3558,
    "course_title": "STAT3558 [0.5 credit]",
    "course_desc": "Random variables and moment-generating functions, concepts of conditioning and correlation; laws of large numbers, central limit theorem; multivariate normal distribution; distributions of functions of random variables, sampling distributions, order statistics.",
    "course_extra_details": "Precludes additional credit for STAT3508 and STAT 3608.\nPrerequisite(s): i) STAT2655 with a grade of C- or higher; and ii) MATH2000 with a grade of C- or higher, or (a grade of C+ or higher in MATH2008 or MATH2004, and permission of the instructor); or permission of the School.\nLectures three hours a week, tutorial one hour a week.\n",
    "course_prerequisites": "i) STAT2655 with a grade of C- or higher; and ii) MATH2000 with a grade of C- or higher, or (a grade of C+ or higher in MATH2008 or MATH2004, and permission of the instructor); or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 3559",
    "course_code": "STAT3559",
    "course_number": 3559,
    "course_title": "STAT3559 [0.5 credit]",
    "course_desc": "Empirical distribution functions, Monte Carlo methods, elements of decision theory, point estimation, interval estimation, tests of hypotheses, robustness, nonparametric methods.",
    "course_extra_details": "Precludes additional credit for STAT3509.\nPrerequisite(s): STAT3558 with a grade of C- or higher; or (STAT3508 with a grade of B or higher, and permission of the instructor); or permission of the School.\nLectures three hours a week, tutorial one hour a week.\n",
    "course_prerequisites": "STAT3558 with a grade of C- or higher; or (STAT3508 with a grade of B or higher, and permission of the instructor); or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 3660",
    "course_code": "STAT3660",
    "course_number": 3660,
    "course_title": "STAT3660 [0.5 credit]",
    "course_desc": "Severity, frequency models, loss models, risk measures, value at risk, stochastic processes, Poisson process, characteristics of actuarial models, creating new univariate distributions, heavy-tailed distributions, mixed distributions, coverage modifications.",
    "course_extra_details": "Prerequisite(s): STAT2655, or permission from the school.\nLectures three hours a week, tutorial one hour a week.\n",
    "course_prerequisites": "STAT2655, or permission from the school.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 3661",
    "course_code": "STAT3661",
    "course_number": 3661,
    "course_title": "STAT3661 [0.5 credit]",
    "course_desc": "Introduction to life insurance; traditional and modern insurance contracts; underwriting; premiums; present value random variable; force of mortality; life tables; insurance benefits; annuities; premium calculation, reserves.",
    "course_extra_details": "Prerequisite(s): STAT2660 and STAT3660, or permission of the School.\nLectures three hours a week, tutorial one hour a week.\n",
    "course_prerequisites": "STAT2660 and STAT3660, or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 3907",
    "course_code": "STAT3907",
    "course_number": 3907,
    "course_title": "STAT3907 [0.5 credit]",
    "course_desc": "Available only to students whose program requires a 0.5 credit not offered by the School of Mathematics and Statistics.",
    "course_extra_details": null,
    "course_prerequisites": null,
    "year_standing": 0
},

{
    "course_identifier": "STAT 3999",
    "course_code": "STAT3999",
    "course_number": 3999,
    "course_title": "STAT3999 [0.0 credit]",
    "course_desc": "Includes: Experiential Learning Activity",
    "course_extra_details": "Includes: Experiential Learning Activity\n",
    "course_prerequisites": null,
    "year_standing": 0
},

{
    "course_identifier": "STAT 4500",
    "course_code": "STAT4500",
    "course_number": 4500,
    "course_title": "STAT4500 [0.5 credit]",
    "course_desc": "Preliminaries on probability theory; exact and asymptotic sampling distributions; unbiasedness, consistency, efficiency, sufficiency and completeness; properties of maximum likelihood estimators; least squares estimation of location and scale parameters based on order statistics and sample quantiles; Best Asymptotically Normal (BAN) estimators.",
    "course_extra_details": "Prerequisite(s): STAT3559 or permission of the School.\nAlso offered at the graduate level, with different requirements, as STAT5600, for which additional credit is precluded.\nLectures three hours a week.\n",
    "course_prerequisites": "STAT3559 or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4501",
    "course_code": "STAT4501",
    "course_number": 4501,
    "course_title": "STAT4501 [0.5 credit]",
    "course_desc": "Introduction to probability, characteristic functions, probability distributions, limit theorems.",
    "course_extra_details": "Prerequisite(s): STAT3506 and STAT3558 or permission of the School.\nLectures three hours a week.\n",
    "course_prerequisites": "STAT3506 and STAT3558 or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4502",
    "course_code": "STAT4502",
    "course_number": 4502,
    "course_title": "STAT4502 [0.5 credit]",
    "course_desc": "Basic concepts in sampling from finite populations; simple random sampling; stratified sampling; choice of sampling unit; cluster and systematic sampling; introduction to multistage sampling; ratio estimation; sampling with unequal probabilities and with replacement; replicated sampling; related topics.",
    "course_extra_details": "Prerequisite(s): i) STAT2559 or STAT2509; and ii) either STAT3559, or a grade of C +  or better in STAT3509; or permission of the School.\nLectures three hours a week.\n",
    "course_prerequisites": "i) STAT2559 or STAT2509; and ii) either STAT3559, or a grade of C +  or better in STAT3509; or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4503",
    "course_code": "STAT4503",
    "course_number": 4503,
    "course_title": "STAT4503 [0.5 credit]",
    "course_desc": "Selected topics in regression and correlation non-linear models. Multivariate statistical methods, principal components, factor analysis, multivariate analysis of variance, discriminant analysis, canonical correlation, analysis of categorical data.",
    "course_extra_details": "Prerequisite(s): STAT3553 or (STAT3509 and STAT3503) or permission of the School.\nAlso offered at the graduate level, with different requirements, as STAT5509, for which additional credit is precluded.\nLectures three hours a week.\n",
    "course_prerequisites": "STAT3553 or (STAT3509 and STAT3503) or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4504",
    "course_code": "STAT4504",
    "course_number": 4504,
    "course_title": "STAT4504 [0.5 credit]",
    "course_desc": "An extension of the designs discussed in STAT 2559 to include analysis of the completely randomized design, designs with more than one blocking variable, incomplete block designs, fractional factorial designs, multiple comparisons; and response surface methods.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrecludes additional credit for STAT3504 and ECON4706. PSYC3000 is precluded for additional credit for students registered in a Mathematics program.\nPrerequisite(s): STAT3553 or STAT3503; or permission of the School of Mathematics and Statistics.\nLectures three hours a week, laboratory one hour a week.\n",
    "course_prerequisites": "STAT3553 or STAT3503; or permission of the School of Mathematics and Statistics.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4506",
    "course_code": "STAT4506",
    "course_number": 4506,
    "course_title": "STAT4506 [0.5 credit]",
    "course_desc": "Order statistics; projections; U-statistics; L-estimators; rank, sign, and permutation test statistics; nonparametric tests of goodness-of-fit, homogeneity, symmetry, and independence; nonparametric density estimation; nonparametric regression analysis: kernel estimators, orthogonal series estimators, smoothing splines; high-dimensional inference and false discovery.",
    "course_extra_details": "Prerequisite(s): STAT3559 or permission of the School.\nAlso offered at the graduate level, with different requirements, as STAT5516, for which additional credit is precluded.\nLectures three hours a week.\n",
    "course_prerequisites": "STAT3559 or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4507",
    "course_code": "STAT4507",
    "course_number": 4507,
    "course_title": "STAT4507 [0.5 credit]",
    "course_desc": "Sufficient statistics, simple and composite hypotheses, most powerful and similar region test, distribution-free tests, confidence intervals, goodness-of-fit and likelihood ratio tests, large sample theory, Bayesian and likelihood methods, sequential tests.",
    "course_extra_details": "Prerequisite(s): STAT4500 or permission of the School.\nAlso offered at the graduate level, with different requirements, as STAT5501, for which additional credit is precluded.\nLectures three hours a week.\n",
    "course_prerequisites": "STAT4500 or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4508",
    "course_code": "STAT4508",
    "course_number": 4508,
    "course_title": "STAT4508 [0.5 credit]",
    "course_desc": "Review of discrete Markov chains and Poisson processes; continuous time Markov chains; pure jump Markov processes, and birth and death processes including the Q-matrix approach; the Kolmogorov equations; renewal theory; introduction to Brownian motion; queueing theory.",
    "course_extra_details": "Prerequisite(s): STAT3506 or permission of the School.\nAlso offered at the graduate level, with different requirements, as STAT5701, for which additional credit is precluded.\nLectures three hours a week.\n",
    "course_prerequisites": "STAT3506 or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4509",
    "course_code": "STAT4509",
    "course_number": 4509,
    "course_title": "STAT4509 [0.5 credit]",
    "course_desc": "Real-life situations in the physical, social, and life sciences are often modeled using mathematical tools. This course will examine various models and techniques used in their analysis, e.g., matrix procedures in connection with population models. Students will use a computer package to obtain numerical results.",
    "course_extra_details": "Prerequisite(s): i) MATH2454 and STAT2655 (or MATH2404 and STAT2605) and ii) STAT3506; or permission of the School.\nAlso offered at the graduate level, with different requirements, as STAT5601, for which additional credit is precluded.\nLectures three hours a week.\n",
    "course_prerequisites": "i) MATH2454 and STAT2655 (or MATH2404 and STAT2605) and ii) STAT3506; or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4555",
    "course_code": "STAT4555",
    "course_number": 4555,
    "course_title": "STAT4555 [0.5 credit]",
    "course_desc": "Basic ideas and algorithms of Monte Carlo; simulation of basic stochastic processes. Brownian motion and the Poisson process, applications to financial modelling, queueing theory. Output analysis; variance reduction. Markov chain Monte Carlo methods; Gibbs sampling, simulated annealing and Metropolis-Hastings samplers with applications.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrecludes additional credit for STAT 3555 (no longer offered).\nPrerequisite(s): STAT3558, or a grade of B or higher in STAT3508, or  permission of the School.\nLectures three hours a week, tutorial/laboratory one hour a week.\n",
    "course_prerequisites": "STAT3558, or a grade of B or higher in STAT3508, or  permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4601",
    "course_code": "STAT4601",
    "course_number": 4601,
    "course_title": "STAT4601 [0.5 credit]",
    "course_desc": "Data visualization; knowledge discovery in datasets; unsupervised learning: clustering algorithms; dimension reduction; supervised learning: pattern recognition, smoothing techniques, classification. Computer software will be used.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrerequisite(s): STAT3553 or STAT3503 or MATH3806, or permission of the School.\nLectures three hours a week, laboratory one hour a week.\n",
    "course_prerequisites": "STAT3553 or STAT3503 or MATH3806, or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4603",
    "course_code": "STAT4603",
    "course_number": 4603,
    "course_title": "STAT4603 [0.5 credit]",
    "course_desc": "Time series regression.  Nonstationary and stationary time series models. Nonseasonal and seasonal time series models.  ARIMA (Box-Jenkins) models.  Smoothing methods.  Parameter estimation, model identification, diagnostic checking.  Forecasting techniques.  A statistical software package will be used.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrerequisite(s): STAT3553 or STAT3503, or permission of the School.\nLectures three hours a week.\n",
    "course_prerequisites": "STAT3553 or STAT3503, or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4604",
    "course_code": "STAT4604",
    "course_number": 4604,
    "course_title": "STAT4604 [0.5 credit]",
    "course_desc": "Statistical computing techniques, pseudo-random number generation, tests for randomness, numerical algorithms in statistics; optimization techniques; environments for data analysis, efficient programming techniques; statistics with mainstream software.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrerequisite(s): STAT3553 or STAT3503 or permission of the School.\nLectures three hours a week, laboratory one hour a week.\n",
    "course_prerequisites": "STAT3553 or STAT3503 or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4607",
    "course_code": "STAT4607",
    "course_number": 4607,
    "course_title": "STAT4607 [0.5 credit]",
    "course_desc": "Probability basics for Bayesian statistics. Bayesian inference for simple exponential families. Markov Chain Monte Carlo for posterior inference. Empirical Bayes. Hierarchical Bayes. Bayesian inference for the multivariate normal model. Bayesian linear regression. More advanced topics may be included. Computer software will be used.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrerequisite(s): STAT3553 or permission of the School.\nLectures three hours a week, laboratory one hour a week.\n",
    "course_prerequisites": "STAT3553 or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4660",
    "course_code": "STAT4660",
    "course_number": 4660,
    "course_title": "STAT4660 [0.5 credit]",
    "course_desc": "Empirical models, complete data, grouped data, credibility theory, failure time, accuracy, kernel estimation, goodness of fit tests, Bayesian analysis, inference for loss models, frequentist estimation, model selection.",
    "course_extra_details": "Prerequisite(s): STAT3660 with C+ or higher, or permission of the school.\nLectures three hours a week, tutorial one hour a week.\n",
    "course_prerequisites": "STAT3660 with C+ or higher, or permission of the school.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4661",
    "course_code": "STAT4661",
    "course_number": 4661,
    "course_title": "STAT4661 [0.5 credit]",
    "course_desc": "Policy values; multiple state models; formulae for probability; Markov multiple state models; pension mathematics; yield curves; interest rate risk; emerging costs for life insurance; equity linked insurance; deterministic and stochastic pricing; reserving, participating, and universal life insurance.",
    "course_extra_details": "Precludes additional credit for STAT 3662 (no longer offered).\nPrerequisite(s): STAT3661 with a grade of C+ or higher; or permission of the School.\nLectures three hours a week, tutorial one hour a week.\n",
    "course_prerequisites": "STAT3661 with a grade of C+ or higher; or permission of the School.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4905",
    "course_code": "STAT4905",
    "course_number": 4905,
    "course_title": "STAT4905 [0.5 credit]",
    "course_desc": "Consists of a written report on some approved topic or topics in the field of statistics, together with a short lecture on the report.",
    "course_extra_details": "Includes: Experiential Learning Activity\nPrerequisite(s): B.Math.(Honours) students only.\n",
    "course_prerequisites": "B.Math.(Honours) students only.",
    "year_standing": 0
},

{
    "course_identifier": "STAT 4907",
    "course_code": "STAT4907",
    "course_number": 4907,
    "course_title": "STAT4907 [0.5 credit]",
    "course_desc": "Prerequisite(s): B.Math.(Honours) students only.",
    "course_extra_details": "Prerequisite(s): B.Math.(Honours) students only.\n",
    "course_prerequisites": "B.Math.(Honours) students only.",
    "year_standing": 0
}]}